sensorOpt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       66801;
    }
    right
    {
        type            patch;
        nFaces          60;
        startFace       66901;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       66961;
    }
    left
    {
        type            patch;
        nFaces          60;
        startFace       67061;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          33346;
        startFace       67121;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          33346;
        startFace       100467;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          301;
        startFace       133813;
    }
)

// ************************************************************************* //
